; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph5 - mode
	image1 - mode
	thermograph4 - mode
	thermograph3 - mode
	infrared2 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation8 - direction
	Star9 - direction
	Star7 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star7)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph5)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument3 thermograph5)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star7)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star6)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(have_image Planet11 thermograph3)
	(have_image Star12 thermograph3)
	(have_image Planet13 thermograph0)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon14 thermograph0)
	(have_image Phenomenon15 thermograph3)
))

)

; plan
1. (turn_to satellite0 groundstation5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 planet13 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet13)
   goals met: 0 of 7
5. (take_image satellite0 planet13 instrument1 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon14 instrument1 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon14 instrument1 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 3 of 7
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 7
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
11. (turn_to satellite0 groundstation0 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 7
12. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 3 of 7
13. (turn_to satellite0 phenomenon15 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 7
14. (take_image satellite0 phenomenon15 instrument0 thermograph3)
   added: (have_image phenomenon15 thermograph3)
   goals met: 4 of 7
15. (turn_to satellite0 planet11 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet11)
   goals met: 4 of 7
16. (take_image satellite0 planet11 instrument0 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 5 of 7
17. (turn_to satellite0 star12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star12)
   goals met: 5 of 7
18. (take_image satellite0 star12 instrument0 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 6 of 7
19. (turn_to satellite1 groundstation1 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 groundstation1)
   goals met: 7 of 7
